#include"Print.h"
#include<iostream>
using namespace std;
void print_board(int x, int y)
{
    if (x == 0) {
        if (y == 0) cout << "\033[30m\033[47m┌─\033[0m";
        else if (y == 9 - 1) cout << "\033[30m\033[47m┐  \033[0m";
        else cout << "\033[30m\033[47m┬─\033[0m";
    }
    else if (x == 9 - 1) {
        if (y == 0) cout << "\033[30m\033[47m└─\033[0m";
        else if (y == 9 - 1) cout << "\033[30m\033[47m┘  \033[0m";
        else cout << "\033[30m\033[47m┴─\033[0m";
    }
    else {
        if (y == 0) cout << "\033[30m\033[47m├─\033[0m";
        else if (y == 9 - 1) cout << "\033[30m\033[47m┤  \033[0m";
        else cout << "\033[30m\033[47m┼─\033[0m";
    }
}
void print_instructions()
{
    cout << R"(请输入坐标落子，形式为：
x (SPACE)y
您执黑色棋子
请注意：本棋盘从左到右，从上到下都以0为计数起点
x (SPACE)y的输入代表您想在第(x+1)行第(y+1)列落子！
--------------------------------------------
游戏过程中，输入-3可以调出菜单！
游戏过程中，输入-3可以调出菜单！
游戏过程中，输入-3可以调出菜单！
想要退出游戏一定要从菜单退出，不可以直接点窗口右上角的×，否则会丢失局面记录并且导致程序出现致命错误！
想要退出游戏一定要从菜单退出，不可以直接点窗口右上角的×，否则会丢失局面记录并且导致程序出现致命错误！
想要退出游戏一定要从菜单退出，不可以直接点窗口右上角的×，否则会丢失局面记录并且导致程序出现致命错误！
重要的事情强调3遍！
)";
}
void print_main_menu()
{
    cout << R"(欢迎体验不围棋
主菜单:
1. 开始游戏
2. 读取存档
3. 退出
请输入你的选择（1~3）
)";
}
void print_menu_halfway()
{
    cout << R"(菜单：
1.继续游戏
2.存档
3.读档
4.退出游戏
5.调整难度
)";
}